/**
    При написании скриптов зачастую встаёт задача сделать однотипное действие много раз.
    Например, вывести товары из списка один за другим. Или просто перебрать все числа от 1 до 10 и для каждого выполнить одинаковый код.
    Для многократного повторения одного участка кода предусмотрены циклы.
 */


// Цикл «while» . Выполняет повторение блока кода пока условие истинно
while(condition) {
    //? блок кода
}

// цикл for
for(variable; условие; предварительная инструкция) {
    //? блок кода
}